upd: I have also recreated an example referenced in this issue -- the only change was to use a different TF version (1.4.6 instead of 1.4.4):
```
➜  demo192 git:(master) ✗ docker run -it -v $(pwd):/tf -w /tf hashicorp/terraform:latest init

Initializing the backend...
╷
│ Error: Unsupported Terraform Core version
│ 
│   on setup.tf line 2, in terraform:
│    2:   required_version = "1.4.4"
│ 
│ This configuration does not support Terraform version 1.4.6. To proceed, either choose another supported Terraform version or update this version constraint. Version
│ constraints are normally set for good reason, so updating the constraint may lead to other errors or unexpected behavior.
╵
# removed required_version = "1.4.4" from schema.tf here

➜  demo192 git:(master) ✗ docker run -it -v $(pwd):/tf -w /tf hashicorp/terraform:latest init

Initializing the backend...

Initializing provider plugins...
- Finding confluentinc/confluent versions matching "1.42.0"...
- Installing confluentinc/confluent v1.42.0...
- Installed confluentinc/confluent v1.42.0 (signed by a HashiCorp partner, key ID D4A2B1EDB0EC0C8E)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

➜  demo192 git:(master) ✗ docker run -it -v $(pwd):/tf -w /tf hashicorp/terraform:latest validate
Success! The configuration is valid.

➜  demo192 git:(master) ✗ docker run -it -v $(pwd):/tf -w /tf hashicorp/terraform:latest plan -out=tfplan
var.schema_registry_api_key
  Confluent Schema Registry API Key

  Enter a value: DCMGNHUGDYKF....

var.schema_registry_api_secret
  Confluent Schema Registry API Secret

  Enter a value: 

var.schema_registry_id
  Confluent Cloud Schema Registry id

  Enter a value: lsrc-8wrx70

var.schema_registry_rest_endpoint
  Confluent Cloud Schema Registry REST endpoint

  Enter a value: https://psrc-....us-west-2.aws.confluent.cloud


Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # confluent_schema.schema will be created
  + resource "confluent_schema" "schema" {
      + format             = "AVRO"
      + hard_delete        = false
      + id                 = (known after apply)
      + recreate_on_update = false
      + schema             = jsonencode(
            {
              + fields    = [
                  + {
                      + name = "Id"
                      + type = "string"
                    },
                  + {
                      + name = "Value"
                      + type = "string"
                    },
                ]
              + name      = "TestSchema"
              + namespace = "TestNamespace"
              + type      = "record"
            }
        )
      + schema_identifier  = (known after apply)
      + subject_name       = "TestNamespace.TestSchema"
      + version            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
➜  demo192 git:(master) ✗ docker run -it -v $(pwd):/tf -w /tf hashicorp/terraform:latest apply tfplan                
confluent_schema.schema: Creating...
confluent_schema.schema: Still creating... [10s elapsed]
confluent_schema.schema: Creation complete after 10s [id=lsrc-8wrx70/TestNamespace.TestSchema/latest]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

➜  demo192 git:(master) ✗ docker run -it -v $(pwd):/tf -w /tf hashicorp/terraform:latest versio  
Terraform has no command named "versio". Did you mean "version"?

To see all of Terraform's top-level commands, run:
  terraform -help

➜  demo192 git:(master) ✗ docker run -it -v $(pwd):/tf -w /tf hashicorp/terraform:latest version
Terraform v1.4.6
on linux_amd64
+ provider registry.terraform.io/confluentinc/confluent v1.42.0

```

